In [1]:
import pandas as pd

In [3]:
df_students = pd.read_csv('grades.csv', delimiter = ',', header = 'infer')
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0
22       Bill        8.00    NaN
23        Ted         NaN    NaN

In [3]:
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [4]:
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill         8.0    NaN
23   Ted         NaN    NaN

In [ ]:
df_students[df_students.Name == 'Ethan']
df_students

In [ ]:
df_students[df_students.Name == 'Ethan']["StudyHours"]
df_students

In [ ]:
df_students.StudyHours = df_students.StudyHours.fillna(df_students.StudyHours.mean())

In [ ]:
df_students = df_students.dropna(axis=0, how='any')

In [54]:
# Get the mean study hours using to column name as an index
mean_study = df_students['StudyHours'].mean()

# Get the mean grade using the column name as a property (just to make the point!)
mean_grade = df_students.Grade.mean()

# Print the mean study hours and mean grade
print('Average weekly study hours: {}\nAverage grade: {}'.format(mean_study, mean_grade))

Average weekly study hours: 10.522727272727273
Average grade: 49.18181818181818

In [62]:
# Get the mean study hours using to column name as an index
mean_study = df_students['StudyHours'].mean()

# Get the mean grade using the column name as a property (just to make the point!)
mean_grade = df_students.Grade.mean()

# Print the mean study hours and mean grade
print('Average weekly study hours: {:.2f}\nAverage grade: {:.2f}'.format(mean_study, mean_grade))

Average weekly study hours: 10.52
Average grade: 49.18

In [63]:
# Get students who studied for the mean or more hours

df_students[ df_students.StudyHours > mean_study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [65]:
# What was their mean grade?
df_students[ df_students.StudyHours > mean_study]["Grade"].mean()

66.7

In [92]:
df_students.drop([0,"Pass"], axis=1, inplace= True)

In [94]:
passes = pd.Series(["Passed" if i > 60 else "Failed" for i in df_students.Grade])
df_students = pd.concat([df_students, passes.rename("Pass")], axis =1)

In [96]:
passes  = pd.Series(df_students['Grade'] >= 60)